cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'mas-cli/tap'
tap 'pivotal/tap'

brew 'bash'
brew 'bash-completion2'
brew 'brew-cask-completion'
brew 'coreutils'
brew 'docker'
brew 'entr'
brew 'findutils'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'golang'
brew 'httpie'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'kubectx'
brew 'kube-ps1'
brew 'kubernetes-cli'
brew 'mas'
brew 'maven'
brew 'moreutils'
brew 'node'
brew 'openjdk@11'
brew 'packer'
brew 'python3'
brew 'rename'
brew 'springboot'
brew 'terraform'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'vim'
brew 'unrar'
brew 'zsh'
brew 'zsh-completions'

cask 'alfred'
cask 'magnet'
cask 'font-fira-code'
cask 'google-chrome'
cask 'jetbrains-toolbox'
cask 'iterm2'
cask 'skype'
cask 'spotify'
cask 'telegram'
cask 'the-unarchiver'
cask 'vagrant'
cask 'vanilla'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'